import type { SectionCard } from "../assets/types"

export const sectionCard: SectionCard[] = [
  {
    color: "#41b883",
    title: "顺和教会",
    subTitle: "褥子青年团契",
    desc: "服务年龄在18-35周岁的青年人",
  },
  {
    color: "#ff5f45",
    title: "褥子青年团契",
    subTitle: "聚会时间",
    desc: "每周六晚19:00 - 21:00",
  },
  {
    color: "#537895",
    title: "",
    subTitle: "",
    desc: "",
  },
  {
    color: "",
    title: "诚邀您的加入",
    subTitle: "联系我们",
    desc: "我们希望在未来的年日里，继续从青年团契中走出更多符合上帝心意的同工，如有感动可联系团契负责人胡姊妹。<br />（电话：173xxxxx671，微信同号）",
  },
];


export const modalData = {
  title: '褥子青年团契简介',
  body: '顺和教会褥子青年团契成立于2017年7月1号，由本堂牧者重点牧养，至今已发展成由23位服侍同工和70余位肢体组成的青年团契。团契（英语：fellowship或communion），即伙伴关系，源自《圣经》中的“相交”一词，意思为相互交往和建立关系，是指上帝与人之间的相交和基督徒之间相交的亲密关系。青年团契从开设之初，便是以服务年龄在18-35周岁的青年人为主旨，让青年人能够共同交流信仰心得，探讨圣经教义，从而加深对上帝的认识和理解，并在基督里彼此联络，形成相互支持、相互帮助的集体氛围，共同追求信仰的坚定和属灵生命的成长与实践，同时委身教会，献身服侍。尤其在今天这个信仰被世俗冲击的时代，年轻的基督徒更需要一个群体来牧养、支撑他们的属灵生命。正如圣经所说：有人攻胜孤身一人，若有二人便能敌挡他；三股合成的绳子不容易折断。（传道书 4:12 和合本）<br /><br /> “褥子”一词来源于福音书中四个人同心协力抬瘫子来到耶稣面前最终因信心瘫子罪得赦免、拿起褥子行走的奇妙故事。事实上每个人都有自己的褥子，它代表人的软弱与不完美。如果要经历生命的医治、灵命的成长、接纳与赦罪的恩典，需要找到一个群体：在那里，我们不怕展露自己的褥子，也为彼此抬起褥子。我们可以坦然展露真实的自我，接纳彼此最深的软弱，用同理心互相了解。当然，团契不只是美好的人际关系，更是进入与三一真神的联合。神也要透过我们，邀请所有愿意的人来经历这合一的美好！',
  footer: '',
}

// 团契聚会内容简介
export const modalReunionData = {
  title: '团契聚会内容简介',
  body: '团契聚会的主要内容有赞美敬拜、祷告、圣经学习、回应交通、代祷事项的收集与见证分享。通过系统经卷查经（如创世纪、路加福音、约翰福音）和回应的方式让弟兄姊妹对经文有更好的理解和实践。此外，团契也定期有每月一次的交通会，不定期的爱宴、外出户外活动，丰富团契生活，建立弟兄姊妹之间的肢体关系。',
  footer: '',
}